doc/01_Pattern interazione/pattern-non-bloccanti/NONBLOCK_PULL_SOAP.xml

<!-- 1 -->
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:m="http://ente.example/nome-api">
  <soap:Body>
    <m:MRequest>
      <M>
        <o_id>1234</o_id>
        <a>
          <a1s>1</a1s>
          <a2>prova</a2>
        </a>
        <b>prova</b>
      </M>
    </m:MRequest>
  </soap:Body>
</soap:Envelope>




<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:m="http://ente.example/nome-api">
  <soap:Header>
    <m:X-Correlation-ID>c8e191a8-f34f-41ed-82ea-68e096466707</m:X-Correlation-ID>
  </soap:Header>
  <soap:Body>
    <m:MRequestResponse>
      <return>
        <status> accepted </status>
        <message> Preso carico della richiesta </message>
      </return>
    </m:MRequestResponse>
  </soap:Body>
</soap:Envelope>







